Revit 2027 API
WaterChillerType Enumeration
 The type of water chiller.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum WaterChillerType
Public Enumeration WaterChillerType
public enum class WaterChillerType
type WaterChillerType
Members
Member name | Value | Description
AirCooled | 0
WaterCooled | 1
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace